import random
import time
import os

仓库 = {}

# noinspection NonAsciiCharacters
五星角色 = ["刻晴", "莫娜", "七七", "迪卢克", "琴"]
五星武器 = ["阿莫斯之弓", "天空之翼", "四风原典", "天空之卷", "和璞鸢",
        "天空之脊", "狼的末路", "天空之傲", "天空之刃", "风鹰剑"]
五星池子 = 五星武器 + 五星武器
五星限定角色 = ["「「公子」·达达利亚(水)」"]

四星角色 = ["砂糖", "诺艾尔", "菲谢尔", "行秋", "香菱",
        "雷泽", "芭芭拉", "重云", "班尼特", "「掩月天权·凝光(岩)」",
        "「无冕的龙王·北斗(雷)」", "安柏", "凯亚", "丽莎"]
四星武器 = ["弓藏", "绝弦", "昭心", "流浪乐章", "西风长枪",
        "雨裁", "钟剑", "匣里龙吟", "笛剑", "祭礼弓",
        "西风猎弓", "祭礼残章", "西风秘典", "匣里灭辰", "祭礼大剑",
        "西风大剑", "祭礼剑", "西风剑"]
四星池子 = 四星武器 + 四星角色
四星限定角色 = ["「猫尾特调·迪奥娜(冰)」", "「无冕的龙王·北斗(雷)」", "「掩月天权·凝光(岩)」"]
四星歪池子 = ["砂糖", "诺艾尔", "菲谢尔", "行秋", "香菱",
         "雷泽", "芭芭拉", "重云", "班尼特", "安柏",
         "凯亚", "丽莎", "弓藏", "绝弦", "昭心",
         "流浪乐章", "西风长枪", "雨裁", "钟剑", "匣里龙吟",
         "笛剑", "祭礼弓", "西风猎弓", "祭礼残章", "西风秘典",
         "匣里灭辰", "祭礼大剑", "西风大剑", "祭礼剑", "西风剑"]


三星武器 = ["弹弓", "鸦羽弓", "讨龙英杰谭", "黑缨枪", "沐浴龙血的剑",
        "飞天御剑", "冷刃", "神射手之誓", "翡玉法球", "魔导绪论",
        "以理服人", "铁影阔剑", "黎明神剑"]

常驻五星抽卡计数器 = 0
常驻四星抽卡计数器 = 0

限定五星角色计数器 = 0
限定四星角色计数器 = 0
限定五星角色歪池子标志 = False
限定四星角色歪池子标志 = False

限定五星武器计数器 = 0
限定四星武器计数器 = 0

五星固定概率 = 6
四星固定概率 = 51

# 四星次数 = 0
# 五星次数 = 0

祈愿池 = ["奔行世间", "暂别冬都", "神铸赋形"]
选定祈愿池 = 0


def 添加至仓库(物品):
    if 物品 in 仓库.keys():
        仓库[物品] += 1
    else:
        仓库[物品] = 1


def 显示仓库():
    for (k, v) in 仓库.items():
        print(f"{k}: {v}")
    print("\n\n")


# noinspection PyPep8Naming
def 五星概率(抽卡次数):
    if 抽卡次数 > 90:
        抽卡次数 %= 90
    return 6 if (抽卡次数 <= 72) else (994 * ((抽卡次数 - 72) / 18) + 6)


# noinspection PyPep8Naming
def 四星概率(抽卡次数):
    if 抽卡次数 > 10:
        抽卡次数 %= 10
    return 51 if (抽卡次数 <= 6) else (949 * ((抽卡次数 - 6) / 4) + 51)


def 抽卡():
    time.sleep(0.5)
    if 选定祈愿池 == 0:
        抽到的卡 = 常驻抽卡()
        添加至仓库(抽到的卡)
        return 抽到的卡
    elif 选定祈愿池 == 1:
        抽到的卡 = 限定角色抽卡()
        添加至仓库(抽到的卡)
        return 抽到的卡
    elif 选定祈愿池 == 2:
        print('正在开发中...')


def 更换祈愿池():
    global 选定祈愿池
    print('目前有以下祈愿池')
    for i in range(len(祈愿池)):
        print(f"{i + 1}. {祈愿池[i]}")
    print('--------------------')
    t = int(input()) - 1
    if 0 <= t <= 2:
        选定祈愿池 = t


def 常驻抽卡():
    global 常驻五星抽卡计数器, 常驻四星抽卡计数器
    随机数 = random.randint(0, 99999) / 100
    此次四星概率 = 四星概率(常驻四星抽卡计数器)
    此次五星概率 = 五星概率(常驻五星抽卡计数器)
    print('========================')
    # print('抽卡开始')
    if 随机数 < 此次五星概率:
        os.system('color 0E')
        print('抽到五星啦！')
        常驻五星抽卡计数器 = 0
        if 随机数 < 五星固定概率:
            # print('此次不是保底')
            抽到的卡 = random.choice(五星池子)
        else:
            print('此次是保底')
            随机数2 = random.randint(0, 1)
            if 随机数2 == 0:
                抽到的卡 = random.choice(五星武器)
            else:
                抽到的卡 = random.choice(五星角色)
    elif 随机数 > (1000 - 此次四星概率):
        修正值随机数 = random.randint(0, 1000)
        if 修正值随机数 > 65:
            os.system('color 0D')
            常驻五星抽卡计数器 += 1
            print('抽到四星啦！')
            常驻四星抽卡计数器 = 0
            if 随机数 > (1000 - 四星固定概率):
                # print('此次不是保底')
                抽到的卡 = random.choice(四星池子)
            else:
                # print('此次是保底')
                随机数2 = random.randint(0, 1)
                if 随机数2 == 0:
                    抽到的卡 = random.choice(四星武器)
                else:
                    抽到的卡 = random.choice(四星角色)
        else:
            os.system('color 0B')
            print('抽到三星啦:')
            常驻五星抽卡计数器 += 1
            常驻四星抽卡计数器 += 1
            抽到的卡 = random.choice(三星武器)
    else:
        os.system('color 0B')
        print('抽到三星啦:')
        常驻五星抽卡计数器 += 1
        常驻四星抽卡计数器 += 1
        抽到的卡 = random.choice(三星武器)
    print('抽到的是:', 抽到的卡)
    print('========================\n\n')
    os.system('color 0f')
    return 抽到的卡


def 限定角色抽卡():
    global 限定五星角色计数器, 限定四星角色计数器
    global 限定五星角色歪池子标志, 限定四星角色歪池子标志
    随机数 = random.randint(0, 99999) / 100
    此次四星概率 = 四星概率(限定四星角色计数器)
    此次五星概率 = 五星概率(限定五星角色计数器)
    print('========================')
    # print('抽卡开始')
    if 随机数 < 此次五星概率:
        os.system('color 0E')
        print('抽到五星啦！')
        限定五星角色计数器 = 0
        if 限定五星角色歪池子标志:
            限定五星角色歪池子标志 = False
            抽到的卡 = random.choice(五星限定角色)
        else:
            UP角色随机数 = random.randint(0, 1)
            if UP角色随机数 == 1:
                抽到的卡 = random.choice(五星限定角色)
            else:
                限定五星角色歪池子标志 = True
                抽到的卡 = random.choice(五星角色)
    elif 随机数 > (1000 - 此次四星概率):
        修正值随机数 = random.randint(0, 1000)
        if 修正值随机数 > 65:
            os.system('color 0D')
            限定五星角色计数器 += 1
            print('抽到四星啦！')
            限定四星角色计数器 = 0
            if 限定四星角色歪池子标志:
                限定四星角色歪池子标志 = False
                抽到的卡 = random.choice(四星限定角色)
            else:
                UP角色随机数 = random.randint(0, 1)
                if UP角色随机数 == 1:
                    抽到的卡 = random.choice(四星限定角色)
                else:
                    抽到的卡 = random.choice(四星歪池子)
                    限定四星角色歪池子标志 = True
        else:
            os.system('color 0B')
            print('抽到三星啦:')
            限定四星角色计数器 += 1
            限定五星角色计数器 += 1
            抽到的卡 = random.choice(三星武器)
    else:
        os.system('color 0B')
        print('抽到三星啦:')
        限定四星角色计数器 += 1
        限定五星角色计数器 += 1
        抽到的卡 = random.choice(三星武器)
    print('限定抽到的是:', 抽到的卡)
    print('========================\n\n')
    os.system('color 0f')
    return 抽到的卡


# def test抽卡():
#     global 常驻五星抽卡计数器, 常驻四星抽卡计数器, 五星次数, 四星次数
#     随机数 = random.randint(0, 99999) / 100
#     此次四星概率 = 四星概率(常驻四星抽卡计数器)
#     此次五星概率 = 五星概率(常驻五星抽卡计数器)
#     if 随机数 < 此次五星概率:
#         常驻五星抽卡计数器 = 0
#         五星次数 += 1
#         常驻四星抽卡计数器 += 1
#     elif 随机数 > (1000 - 此次四星概率):
#         修正值随机数 = random.randint(0, 1000)
#         if 修正值随机数 > 65:
#             四星次数 += 1
#             常驻五星抽卡计数器 += 1
#             常驻四星抽卡计数器 = 0
#         else:
#             常驻五星抽卡计数器 += 1
#             常驻四星抽卡计数器 += 1
#     else:
#         常驻五星抽卡计数器 += 1
#         常驻四星抽卡计数器 += 1


def 十连抽卡():
    十连卡池 = []
    print("********************************")
    print('十连抽卡开始')
    for i in range(10):
        十连卡池.append(抽卡())
    print('共抽到：', 十连卡池)
    print('十连抽卡结束')
    print('********************************')


def 菜单():
    global 常驻五星抽卡计数器
    print("原神抽卡模拟器")
    print('============')
    print(f'目前选定的祈愿池为 {祈愿池[选定祈愿池]}')
    print("1. 单抽一发")
    print("2. 来个十连")
    print("3. 更换祈愿池")
    print("4. 显示仓库\n")
    print("0.不玩了，开溜")
    print(f'距离上一次常驻池出五星已经有 {常驻五星抽卡计数器} 次')
    print(f'距离上一次UP角色池出五星已经有 {限定五星角色计数器} 次')
    print(f'距离上一次UP武器池出五星已经有 {限定五星武器计数器} 次')
    print("============")
    s = int(input())
    if s == 1:
        抽卡()
    elif s == 2:
        十连抽卡()
    elif s == 3:
        更换祈愿池()
    elif s == 4:
        显示仓库()
    elif s == 0:
        print('欢迎以后再玩！')
        exit(0)


# def test():
#     global 四星次数, 五星次数
#     for j in range(10):
#         for i in range(1000000):
#             test抽卡()
#         print('四星：', 四星次数)
#         print('五星：', 五星次数)
#         四星次数 = 0
#         五星次数 = 0


if __name__ == '__main__':
    while True:
        菜单()
